Revit 2024 API
BuiltInFailures.SketchFailures.BeamDirectionNotSpecified Property
 Beam direction not specified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId BeamDirectionNotSpecified { get; }
Visual Basic
Public Shared ReadOnly Property BeamDirectionNotSpecified As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ BeamDirectionNotSpecified {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace